int/resources/objectRepo/xmlTemplates/htng/HTNG2006Reservation/req_FetchReservation.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://htng.org/PWSWG/2006/08/SingleGuestItinerary/Reservation/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:FetchReservationRequest>
         <typ:ReservationID source="?"/>
         <typ:ResortId/>
      </typ:FetchReservationRequest>
   </soapenv:Body>
</soapenv:Envelope>